template = [{'course':'', 'remark':[{'teacher':'', 'score':[], 'note':'', 'time':''}]}]
course_list = {1: [1066212, '绿色化学原理和实践', 3], 2: [1065101, '材料化学导论', 4], 3: [1066277, '低维纳米材料', 4],
               4: [1066179, '环境化学', 3], 5: [1065144, '科技英语A', 2], 6: [1066199, '无机合成化学', 4],
               7: [1066147, '理论有机化学A', 4], 8: [1066099, '精细化学品化学', 4], 9: [1066155, '配位化学A', 4],
               10: [1066163, '试验设计与化工数据处理A', 4], 11: [1066190, '药物化学A', 3], 12: [1066200, '化学信息学A', 4],
               13: [11456102, '化工原理E', 5], 14: [1066189, '有机合成与设计', 5], 15: [1066241, '现代仪器分析', 4],
               16: [1066223, '现代仪器分析实验', 4], 17: [1066260, '结晶矿物学', 4], 18: [1066209, '计算化学导论', 4],
               19: [1066065, '胶体和表面化学', 3], 20: [1066208, '金属有机化学A', 3], 21: [1066242, '基础电化学原理与技术', 4],
               22: [1066254, '高等有机化学基础', 4], 23: [1066258, '电化学能源技术概论', 3], 24: [1066180, '现代有机合成技术', 3],
               25: [1066224, '能源化学B', 4], 26: [1066255, '配位化学导论', 2], 27: [1066194, '现代食品安全检测技术', 2],
               28: [1066261, '催化化学', 3]}
